DOMAIN_DISTRIBUTION_KO = {
    "일상,소통": 0.2,
    "여행": 0.15,
    "게임": 0.15,
    "경제": 0.05,
    "교육": 0.05,
    "스포츠": 0.05,
    "라이브커머스": 0.15,
    "음식,요리": 0.2
}
DOMAIN_DISTRIBUTION_EN = {
    "일상,소통": 0.2,
    "여행": 0.2,
    "게임": 0.2,
    "음식,요리": 0.2,
    "건강,운동": 0.2
}
DOMAIN_DISTRIBUTION_CH = {
    "일상,소통": 0.2,
    "여행": 0.2,
    "게임": 0.2,
    "라이브커머스": 0.2,
    "패션,뷰티": 0.2
}
DOMAIN_DISTRIBUTION_JP = {
    "일상,소통": 0.2,
    "여행": 0.2,
    "게임": 0.2,
    "음식,요리": 0.2,
    "패션,뷰티": 0.2
}
TOTAL = 600000 # 60만 문장
TIME_TOTAL = 1000 * 60 * 60 # 1000시간에 해당하는 seconds

YTICK_INFO_TIME = {
    "ko": {
        "일상,소통": (int((TIME_TOTAL * 0.20) / 3600), 20),
        "여행": (int((TIME_TOTAL * 0.15) / 3600), 15),
        "게임": (int((TIME_TOTAL * 0.15) / 3600), 15),
        "경제": (int((TIME_TOTAL * 0.05) / 3600), 5),
        "교육": (int((TIME_TOTAL * 0.05) / 3600), 5),
        "스포츠": (int((TIME_TOTAL * 0.05) / 3600), 5),
        "라이브커머스": (int((TIME_TOTAL * 0.15) / 3600), 15),
        "음식,요리": (int((TIME_TOTAL * 0.20) / 3600), 20)
    },
    "en": {
            "일상,소통": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "여행": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "게임": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "음식,요리": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "건강,운동": (int((TIME_TOTAL * 0.20) / 3600), 20)
        },
    "ja" : {
            "일상,소통": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "여행": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "게임": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "음식,요리": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "패션,뷰티": (int((TIME_TOTAL * 0.20) / 3600), 20)
        },
    "zh" : {
            "일상,소통": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "여행": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "게임": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "라이브커머스": (int((TIME_TOTAL * 0.20) / 3600), 20),
            "패션,뷰티": (int((TIME_TOTAL * 0.20) / 3600), 20)
        }
    }
YTICK_INFO = {
    "ko": {
        "일상,소통": (int((TOTAL * 0.20)), 20),
        "여행": (int((TOTAL * 0.15)), 15),
        "게임": (int((TOTAL * 0.15)), 15),
        "경제": (int((TOTAL * 0.05)), 5),
        "교육": (int((TOTAL * 0.05)), 5),
        "스포츠": (int((TOTAL * 0.05)), 5),
        "라이브커머스": (int((TOTAL * 0.15)), 15),
        "음식,요리": (int((TOTAL * 0.20)), 20)
    },
    "en": {
            "일상,소통": (int((TOTAL * 0.20)), 20),
            "여행": (int((TOTAL * 0.20)), 20),
            "게임": (int((TOTAL * 0.20)), 20),
            "음식,요리": (int((TOTAL * 0.20)), 20),
            "건강,운동": (int((TOTAL * 0.20)), 20)
        },
    "ja" : {
            "일상,소통": (int((TOTAL * 0.20)), 20),
            "여행": (int((TOTAL * 0.20)), 20),
            "게임": (int((TOTAL * 0.20)), 20),
            "음식,요리": (int((TOTAL * 0.20)), 20),
            "패션,뷰티": (int((TOTAL * 0.20)), 20)
        },
    "zh" : {
            "일상,소통": (int((TOTAL * 0.20)), 20),
            "여행": (int((TOTAL * 0.20)), 20),
            "게임": (int((TOTAL * 0.20)), 20),
            "라이브커머스": (int((TOTAL * 0.20)), 20),
            "패션,뷰티": (int((TOTAL * 0.20)), 20)
        }
    }