DOMAIN_DISTRIBUTION_KO = {
    "일상,소통": 0.2,
    "여행": 0.15,
    "게임": 0.15,
    "경제": 0.05,
    "교육": 0.05,
    "스포츠": 0.05,
    "라이브커머스": 0.15,
    "음식,요리": 0.2
}
DOMAIN_DISTRIBUTION_EN = {
    "일상,소통": 0.2,
    "여행": 0.2,
    "게임": 0.2,
    "음식,요리": 0.2,
    "운동,건강": 0.2
}
DOMAIN_DISTRIBUTION_CH = {
    "일상,소통": 0.2,
    "여행": 0.2,
    "게임": 0.2,
    "라이브커머스": 0.2,
    "패션,뷰티": 0.2
}
DOMAIN_DISTRIBUTION_JP = {
    "일상,소통": 0.2,
    "여행": 0.2,
    "게임": 0.2,
    "음식,요리": 0.2,
    "패션,뷰티": 0.2
}
TOTAL = 600000 # 40만 문장
TIME_TOTAL = 1000 * 60 * 60 # 1000시간에 해당하는 seconds